// CodeEditor.h

/*!
	\brief Модуль: Просмотр и редактирование кода фильтров и плагинов

	\details В данном модуле содержатся функции, позволяющие просматривать и редактировать исходный код фильтров и плагинов.
*/
class CodeEditor {
public:
    /*!
		\brief Метод для редактирования кода фильтра

		\details Этот метод позволяет открыть и изменить код определенного фильтра.
	*/
    void editFilterCode();

    /*!
		\brief Метод для редактирования кода плагина

		\details Этот метод позволяет открыть и изменить код определенного плагина.
	*/
    void editPluginCode();
};
