// DrawingTools.cpp

#include "DrawingTools.h"

/*!
	\brief Модуль: Инструменты рисования

	\details В данном модуле содержатся функции для работы с инструментами рисования, такими как кисть и ластик.
*/

void DrawingTools::useBrush() {
    /// \brief Метод для использования кисти
    /// \details Этот метод позволяет использовать кисть для рисования.
}

void DrawingTools::useEraser() {
    /// \brief Метод для использования ластика
    /// \details Этот метод позволяет использовать ластик для стирания.
}
