// FiltersAndEffects.h

/*!
	\brief Модуль: Фильтры и эффекты

	\details В данном модуле содержатся функции для применения фильтров и эффектов к изображению.
*/
class FiltersAndEffects {
public:
    /*!
		\brief Метод для применения фильтра к изображению

		\details Этот метод позволяет применить выбранный фильтр к изображению.
	*/
    void applyFilter();

    /*!
		\brief Метод для применения эффекта к изображению

		\details Этот метод позволяет применить выбранный эффект к изображению.
	*/
    void applyEffect();
};
