// GIFEditor.h

/*!
	\brief Модуль: Создание и редактирование анимированных GIF-изображений

	\details В данном модуле содержатся функции для создания и редактирования анимированных GIF-изображений.
*/
class GIFEditor {
public:
    /*!
		\brief Метод для создания анимированного GIF

		\details Этот метод позволяет создать анимированное GIF-изображение из последовательности кадров.
	*/
    void createGIF();

    /*!
		\brief Метод для редактирования анимированного GIF

		\details Этот метод позволяет редактировать анимированное GIF-изображение, добавляя или удаляя кадры.
	*/
    void editGIF();
};
