// GIFEditor.cpp

#include "GIFEditor.h"

/*!
	\brief Модуль: Создание и редактирование анимированных GIF-изображений

	\details В данном модуле содержатся функции для создания и редактирования анимированных GIF-изображений.
*/

void GIFEditor::createGIF() {
    /// \brief Метод для создания анимированного GIF
    /// \details Этот метод позволяет создать анимированное GIF-изображение из последовательности кадров.
}

void GIFEditor::editGIF() {
    /// \brief Метод для редактирования анимированного GIF
    /// \details Этот метод позволяет редактировать анимированное GIF-изображение, добавляя или удаляя кадры.
}
