// LayerManagement.h

/*!
	\brief Модуль: Создание и управление слоями изображения

	\details В данном модуле содержатся функции для создания и управления слоями изображения.
*/
class LayerManagement {
public:
    /*!
		\brief Метод для создания слоя изображения

		\details Этот метод создает новый слой изображения.
	*/
    void createLayer();

    /*!
		\brief Метод для управления слоем изображения

		\details Этот метод позволяет управлять параметрами и позицией слоя изображения.
	*/
    void manageLayer();
};
