// PluginsAndExtensions.h

/*!
	\brief Модуль: Плагины и расширения

	\details В данном модуле содержатся функции для добавления и использования плагинов и расширений.
*/
class PluginsAndExtensions {
public:
    /*!
		\brief Метод для добавления плагина

		\details Этот метод позволяет добавить новый плагин или расширение к редактору.
	*/
    void addPlugin();

    /*!
		\brief Метод для использования плагина

		\details Этот метод позволяет использовать функционал добавленного плагина или расширения.
	*/
    void usePlugin();
};
