// Selection.cpp

#include "Selection.h"

/*!
	\brief Модуль: Выделение и удаление части изображения

	\details В данном модуле содержатся функции для выделения и удаления части изображения.
*/

void Selection::selectArea() {
    /// \brief Метод для выделения области изображения
    /// \details Этот метод позволяет пользователю выделить область изображения для дальнейших операций.
}

void Selection::deleteSelection() {
    /// \brief Метод для удаления выделенной области изображения
    /// \details Этот метод удаляет выделенную область изображения.
}
