// SpecialEffects.cpp

#include "SpecialEffects.h"

/*!
	\brief Модуль: Специальные эффекты

	\details В данном модуле содержатся функции для добавления специальных эффектов к изображению.
*/

void SpecialEffects::addGlow() {
    /// \brief Метод для добавления свечения
    /// \details Этот метод добавляет свечение к изображению для создания специального эффекта.
}

void SpecialEffects::addShadow() {
    /// \brief Метод для добавления тени
    /// \details Этот метод добавляет тень к изображению для создания специального эффекта.
}
