// Templates.cpp

#include "Templates.h"

/*!
	\brief Модуль: Создание и применение шаблонов

	\details В данном модуле содержатся функции для создания и применения шаблонов к изображениям.
*/

void Templates::createTemplate() {
    /// \brief Метод для создания шаблона
    /// \details Этот метод позволяет создать новый шаблон для применения к изображениям.
}

void Templates::applyTemplate() {
    /// \brief Метод для применения шаблона
    /// \details Этот метод применяет выбранный шаблон к изображению.
}
