// TextEditing.h

/*!
	\brief Модуль: Добавление и редактирование текста

	\details В данном модуле содержатся функции для добавления и редактирования текста на изображениях.
*/
class TextEditing {
public:
    /*!
		\brief Метод для добавления текста на изображение

		\details Этот метод позволяет пользователю добавить текст на изображение.
	*/
    void addText();

    /*!
		\brief Метод для редактирования текста на изображении

		\details Этот метод позволяет пользователю отредактировать текст на изображении.
	*/
    void editText();
};
