// Toolbar.h

/*!
	\brief Модуль: Панель инструментов

	\details В данном модуле содержатся функции для настройки и использования панели инструментов.
*/
class Toolbar {
public:
    /*!
		\brief Метод для настройки панели инструментов

		\details Этот метод позволяет пользователю настроить панель инструментов по своему усмотрению.
	*/
    void customizeToolbar();

    /*!
		\brief Метод для добавления нового инструмента на панель

		\details Этот метод позволяет добавить новый инструмент на панель инструментов.
	*/
    void addTool();
};
