var searchData=
[
  ['работа_20с_20изображением_20или_20слоями_20напрямую_0',['Работа с изображением или слоями напрямую',['../md__d_1_2_projects_2_p_p_p_i_2_x_d0_x9_f_x_d1_x80_x_d0_x_b_e_x_d0_x_b3_x_d1_x80_x_d0_x_b0_x_d0_xc4db5289ac818389d0b055de7484a04d.html#autotoc_md3',1,'']]],
  ['растровый_20редактор_1',['Описание модулей разрабатываемого программного продукта &quot;Растровый редактор&quot;',['../md__d_1_2_projects_2_p_p_p_i_2_x_d0_x9_f_x_d1_x80_x_d0_x_b_e_x_d0_x_b3_x_d1_x80_x_d0_x_b0_x_d0_xc4db5289ac818389d0b055de7484a04d.html',1,'']]],
  ['разрабатываемого_20программного_20продукта_20растровый_20редактор_2',['Описание модулей разрабатываемого программного продукта &quot;Растровый редактор&quot;',['../md__d_1_2_projects_2_p_p_p_i_2_x_d0_x9_f_x_d1_x80_x_d0_x_b_e_x_d0_x_b3_x_d1_x80_x_d0_x_b0_x_d0_xc4db5289ac818389d0b055de7484a04d.html',1,'']]],
  ['редактор_3',['Описание модулей разрабатываемого программного продукта &quot;Растровый редактор&quot;',['../md__d_1_2_projects_2_p_p_p_i_2_x_d0_x9_f_x_d1_x80_x_d0_x_b_e_x_d0_x_b3_x_d1_x80_x_d0_x_b0_x_d0_xc4db5289ac818389d0b055de7484a04d.html',1,'']]]
];
