var searchData=
[
  ['программные_20модули_20из_20adobe_20photoshop_3a_0',['Программные модули из Adobe Photoshop:',['../md__d_1_2_projects_2_p_p_p_i_2_x_d0_x9_f_x_d1_x80_x_d0_x_b_e_x_d0_x_b3_x_d1_x80_x_d0_x_b0_x_d0_xc4db5289ac818389d0b055de7484a04d.html#autotoc_md2',1,'']]],
  ['прочий_20функционал_1',['Прочий функционал',['../md__d_1_2_projects_2_p_p_p_i_2_x_d0_x9_f_x_d1_x80_x_d0_x_b_e_x_d0_x_b3_x_d1_x80_x_d0_x_b0_x_d0_xc4db5289ac818389d0b055de7484a04d.html#autotoc_md5',1,'']]],
  ['программного_20продукта_20растровый_20редактор_2',['Описание модулей разрабатываемого программного продукта &quot;Растровый редактор&quot;',['../md__d_1_2_projects_2_p_p_p_i_2_x_d0_x9_f_x_d1_x80_x_d0_x_b_e_x_d0_x_b3_x_d1_x80_x_d0_x_b0_x_d0_xc4db5289ac818389d0b055de7484a04d.html',1,'']]],
  ['продукта_20растровый_20редактор_3',['Описание модулей разрабатываемого программного продукта &quot;Растровый редактор&quot;',['../md__d_1_2_projects_2_p_p_p_i_2_x_d0_x9_f_x_d1_x80_x_d0_x_b_e_x_d0_x_b3_x_d1_x80_x_d0_x_b0_x_d0_xc4db5289ac818389d0b055de7484a04d.html',1,'']]]
];
